InformationRegisters/АктивностьПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АктивностьПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСессии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АктивностьПользователей/Ext/ManagerModule.bsl
Функция ПолучитьДатуПоследнейАктивности(Пользователь, Знач НомерСессии = 0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктивностьПользователей.ДатаПоследнегоДействия КАК ДатаПоследнегоДействия
	|ИЗ
	|	РегистрСведений.АктивностьПользователей КАК АктивностьПользователей
	|ГДЕ
	|	АктивностьПользователей.Пользователь = &Пользователь
	|	И ВЫБОР
	|			КОГДА &НомерСессии = 0
	|				ТОГДА 1 = 1
	|			ИНАЧЕ АктивностьПользователей.НомерСессии = &НомерСессии
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НомерСессии", НомерСессии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ДатаПоследнегоДействия;
	КонецЦикла;
	
	Возврат Дата(1,1,1);
	
КонецФункции
